2020-gentoo-install.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://lampze.github.io/rss.xml"
      title="RSS feed for https://lampze.github.io/">
<title>2020年gentoo安装分析</title>
<meta  name="author" content="lampze" />
      <link href= "static/style.css" rel="stylesheet" type="text/css" />
      <link href= "static/org.css" rel="stylesheet" type="text/css" />
      <meta http-equiv="content-type" content="application/xhtml+xml; charset=UTF-8" />
      <meta name="viewport" content="initial-scale=1,width=device-width,minimum-scale=1"></head>
<body>
<div id="preamble" class="status"><div class="header">
        <a href="https://lampze.github.io">lampze's Blog</a>
      </div></div>
<div id="content">
<div class="post-date">30 6月 2020</div><h1 class="post-title"><a href="https://lampze.github.io/2020-gentoo-install.html">2020年gentoo安装分析</a></h1>
<nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf8b0f1c">前言</a></li>
<li><a href="#org6a237f2">安装</a>
<ul>
<li><a href="#org63312a8">准备</a>
<ul>
<li><a href="#orgc0571fb">配置选择</a></li>
<li><a href="#org4219242">安装环境</a></li>
<li><a href="#org86f319e">安装准备</a></li>
</ul>
</li>
<li><a href="#org41794ca">安装</a>
<ul>
<li><a href="#org218298c">初始系统</a></li>
<li><a href="#org8c4b83f">chroot</a></li>
<li><a href="#orgbb85abc">配置包管理</a></li>
<li><a href="#org996966b">内核</a></li>
<li><a href="#org3ea6397">必备配置</a></li>
<li><a href="#org576bbd4">引导</a></li>
</ul>
</li>
<li><a href="#org1ccd705">配置</a>
<ul>
<li><a href="#org616a7e9">地区配置</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org7cc1a49">后记</a></li>
</ul>
</div>
</nav>

<div id="outline-container-orgf8b0f1c" class="outline-2">
<h2 id="orgf8b0f1c">前言</h2>
<div class="outline-text-2" id="text-orgf8b0f1c">
<p>
我使用Gentoo也有一段时间了，之前还尝试了一下Funtoo最后还是换到了Gentoo下，正好把安装的过程记录一下。相比原来，现在的Gentoo变化也挺大的，没了一些坑，但又新增了一些坑。
</p>

<p>
新手安装配置Gentoo时最好先把教程文档都大致看一遍，最好把<a href="https://wiki.archlinux.org/index.php/Main_page">Arch</a>、<a href="https://wiki.gentoo.org/wiki/Handbook:AMD64">Gentoo</a>、<a href="https://www.funtoo.org/Install/Introduction">Funtoo</a>的文档都浏览一下。<br>
建议最好看英文的，更新的最即时坑最少，毕竟你要安装的是一个滚动更新的系统，太老的教程是要出事的。
</p>

<p>
因为一些东西是变来变去的，所以我尽量把原理讲清楚，具体的命令最好参考我给出的文档。
</p>

<p>
在安装过程中如果提示找不到命令，请自行百度你的Linux发行版怎么安装这个命令。
</p>
</div>
</div>

<div id="outline-container-org6a237f2" class="outline-2">
<h2 id="org6a237f2">安装</h2>
<div class="outline-text-2" id="text-org6a237f2">
</div>
<div id="outline-container-org63312a8" class="outline-3">
<h3 id="org63312a8">准备</h3>
<div class="outline-text-3" id="text-org63312a8">
</div>
<div id="outline-container-orgc0571fb" class="outline-4">
<h4 id="orgc0571fb">配置选择</h4>
<div class="outline-text-4" id="text-orgc0571fb">
<p>
Gentoo是把初始系统的所有文件打包起来，用户只需要把它解压到指定位置然后配置好内核和引导就可以正常使用了。
</p>

<p>
为了满足不同人的需要，这个初始环境有多种配置可以选择，配置的种类有cpu架构、 <code>stage</code> 、软件包配置等等。当然这些选项都可以后期自己配置更改，只不过官方为了方便用户先集成起来了。
</p>

<p>
cpu架构基本所有平台都有，我们一般人主要就选择x86的64或32位架构。其中 <code>amd64</code> 表示64位， <code>x86</code> 表示32位。
</p>

<p>
<code>stage</code> 就是系统配置的集成程度，想了解可以看<a href="https://wiki.gentoo.org/wiki/Stage_tarball">stage_tarball</a>。 <code>stage</code> 分为4个级别，数字越高表示系统配置程序越高，1和2基本想当于从零开始了，一般人就不要选了，而 <code>stage 4</code> 就相当于开箱即用了，官方推荐的是 <code>stage 3</code> 。
</p>

<p>
最后就是一些什么不要32位的软件、最小配置、使用 <code>systemd</code> 、注重系统安全...的选项了，这些就看个人。桌面用户就考虑一下 <code>systemd</code> 就行了，但我觉得都玩Gentoo了体验一下 <code>openrc</code> 也不错，其它的一般人玩不动。
</p>
</div>
</div>

<div id="outline-container-org4219242" class="outline-4">
<h4 id="org4219242">安装环境</h4>
<div class="outline-text-4" id="text-org4219242">
<p>
因为是命令行安装的，所以要想安装Gentoo需要一个现成的Linux环境，如果你已经安装了一个Linux就可以直接使用它安装Gentoo，如果没有就下个 <code>ISO</code> 境像刻录到u盘。Gentoo官方有专门的最小安装环境，最好找个和将要安装的Gentoo相同配置的环境。
</p>

<p>
刻录 <code>ISO</code> 文件可以参照这个<a href="https://wiki.gentoo.org/wiki/FAQ#How_do_I_burn_an_ISO_file.3F">How do I burn an ISO file?</a>。反正Linux直接用 <code>dd</code> 就行了， win就用 <code>EasyCD</code> 。刻录好后重启进 <code>BIOS</code> 使用 u盘启动就进入安装环境了。
</p>

<p>
国内最好找个镜像下文件，比如<a href="https://mirrors.tuna.tsinghua.edu.cn/gentoo/releases/amd64/autobuilds/current-stage3-amd64/">清华大学镜像站</a>。
</p>
</div>
</div>

<div id="outline-container-org86f319e" class="outline-4">
<h4 id="org86f319e">安装准备</h4>
<div class="outline-text-4" id="text-org86f319e">
<p>
准备无非就是看看能不能联网，要安装的硬盘能不能找到。联网一般不用特别配置，如果没网就安装 <code>NetworkManager</code> ，还不行就看这个<a href="https://wiki.gentoo.org/wiki/Handbook:AMD64/Installation/Networking">网络配置</a>。
</p>

<p>
查看硬盘就用 <code>lsblk</code> 或者 <code>fdisk -l</code> ，找到硬盘记住硬盘号，sda或者sdb什么的，如果记错的话，在后面的安装过程中你的数据就上天了。
</p>

<p>
现在要开始分区了，参考<a href="https://wiki.gentoo.org/wiki/Handbook:AMD64/Installation/Disks">Preparing the disks</a>。一般人选择官方给出的分区配置就行了， <code>boot</code> 分区可以给大一点，内存够大的话 <code>swap</code> 分区可以不给，不想改的话直接翻到下面的分区命令，跟着文档按就分好区了。文档里有两种工具 <code>parted</code> 和 <code>fdisk</code> 随便选一个，介绍的都很详细，当然分区之前一定要确定好硬盘路径。
</p>

<p>
接下来就是选择文件系统， <code>boot</code> 分区使用 <code>ext2</code> 比较稳， <code>swap</code> 有固定的类型。用户自定义的就是 <code>root</code> 分区了，一般使用 <code>ext4</code> 就行了， 也可以选 <code>xfs</code> 。但如果想要更多特性的话可以选 <code>btrfs</code> 或 <code>zfs</code> ，有软raid、cow（写时复制）、动态分区大小之类的特性，当然配置更复杂，读写效率更低。当然用 <code>lvm</code> 工具 也可以实现一些特性。桌面用户就不要瞎凑合了。
</p>

<p>
使用 <code>mkfs</code> 格式化这些分区之后，再用 <code>mount</code> 挂载这些分区，先挂载 <code>root</code> 分区到 <code>/mnt/gentoo</code> 再把 <code>boot</code> 分区挂载到 <code>/mnt/gentoo/boot</code> ，不然后面安装引导会出事的。这样装备工作就完成了，接下来就是安装了。
</p>
</div>
</div>
</div>

<div id="outline-container-org41794ca" class="outline-3">
<h3 id="org41794ca">安装</h3>
<div class="outline-text-3" id="text-org41794ca">
</div>
<div id="outline-container-org218298c" class="outline-4">
<h4 id="org218298c">初始系统</h4>
<div class="outline-text-4" id="text-org218298c">
<p>
首先进入 <code>root</code> 分区挂载的目录，如果跟着官方教程走的话就是 <code>/mnt/gentoo</code> ，然后把下载的 <code>stage</code> 压缩包复制到这个目录。如果关心安全的话可以验证一下，下载页面有密钥的。然后直接解压 <code>stage</code> 就行了。
</p>
<div class="org-src-container">
<pre class="src src-shell">tar xpvf stage3-*.tar.xz --xattrs-include=<span style="color: #8a3b3c;">'*.*'</span> --numeric-owner
</pre>
</div>
</div>
</div>

<div id="outline-container-org8c4b83f" class="outline-4">
<h4 id="org8c4b83f">chroot</h4>
<div class="outline-text-4" id="text-org8c4b83f">
<p>
复制dns的配置文件，不然 <code>chroot</code> 后是没网的。
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="font-weight: bold;">cp</span> --dereference /etc/resolv.conf /mnt/gentoo/etc/
</pre>
</div>

<p>
然后还要 <code>mount</code> 一些分区，不然有些设备是用不了的，这些分区都是系统开机自动生成的，因为我们是 <code>chroot</code> 所以不会自动生成。
</p>
<div class="org-src-container">
<pre class="src src-shell">mount --types proc /proc /mnt/gentoo/proc
mount --rbind /sys /mnt/gentoo/sys
mount --make-rslave /mnt/gentoo/sys
mount --rbind /dev /mnt/gentoo/dev
mount --make-rslave /mnt/gentoo/dev
</pre>
</div>

<p>
仔细检查分区的挂载情况，然后直接 <code>chroot</code> 就进入安装的系统了，后面如果有地方配置不对，就从这一小节重新开始。
注意这三条命令不能一起复制到 <code>shell</code> 执行，因为 <code>chroot</code> 后就是新系统了。
</p>
<div class="org-src-container">
<pre class="src src-shell">chroot /mnt/gentoo /bin/bash
<span style="font-weight: bold;">source</span> /etc/profile
<span style="font-weight: bold;">export</span> <span style="color: #383a42;">PS1</span>=<span style="color: #8a3b3c;">"(chroot) </span><span style="color: #383a42;">$</span><span style="color: #383a42;">{PS1}</span><span style="color: #8a3b3c;">"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbb85abc" class="outline-4">
<h4 id="orgbb85abc">配置包管理</h4>
<div class="outline-text-4" id="text-orgbb85abc">
<p>
因为Gentoo安装软件是在本机编译再安装的，所以可以自定义编译时的优化配置，比如可以专门针对你的cpu进行优化什么的，我们只需要更改几个选项就行了。
</p>

<p>
修改 <code>/etc/portage/make.conf</code> 文件，也可以不改，但后面安装软件时会比较慢，这个文件简单来说就是 <code>make</code> 时的参数配置，还没 <code>chroot</code> 的加上挂载目录的前缀。
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #556b2f;"># </span><span style="color: #556b2f;">&#21518;&#38754;&#25968;&#23383;&#25913;&#25104;&#20320;cpu&#30340;&#32447;&#31243;&#25968;&#21152;1&#65292;&#34920;&#31034;&#24182;&#34892;&#32534;&#35793;&#25968;</span>
<span style="color: #383a42;">MAKEOPTS</span>=<span style="color: #8a3b3c;">"-j5"</span>
<span style="color: #556b2f;"># </span><span style="color: #556b2f;">&#36825;&#20010;&#23601;&#26159;&#26356;&#26032;&#26102;&#30340;&#38236;&#20687;&#22320;&#22336;</span>
<span style="color: #383a42;">GENTOO_MIRRORS</span>=<span style="color: #8a3b3c;">"https://mirrors.neusoft.edu.cn/gentoo/"</span>
</pre>
</div>

<p>
Gentoo的包管理有个叫 <code>portage</code> 的东西，管理所有软件包的安装文件，存放的文件叫 <code>ebuild</code> ，作用是表示软件怎么下载、编译、安装等等。 <code>portage</code> 默认没有配置 <code>repos</code> ，所以我们要先加入官方的 <code>repos</code> 。官方有默认的配置文件，复制就行了，默认是使用 <code>rsync</code> 同步的，后期可以改成 <code>git</code> 的形式同步。下面的路径自己注意，指向安装的系统。
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="font-weight: bold;">mkdir</span> --parents /etc/portage/repos.conf
<span style="font-weight: bold;">cp</span> /usr/share/portage/config/repos.conf /etc/portage/repos.conf/gentoo.conf

<span style="color: #556b2f;"># </span><span style="color: #556b2f;">&#19979;&#36733;portage&#26641;</span>
emerge-webrsync
</pre>
</div>

<p>
然后选择一个 <code>profile</code> ，它对一些软件包做了配置，因为有一些配置是通用的，选择和自己使用方式贴近的就行了。比如桌面用户就选择带 <code>desktop</code> 的，懂点英文的同学应该可以看懂，不懂的跟着文档选择就行了。
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #556b2f;"># </span><span style="color: #556b2f;">&#26597;&#30475;&#20840;&#37096;profile</span>
eselect profile list

<span style="color: #556b2f;"># </span><span style="color: #556b2f;">&#36873;&#25321;profile&#20026;x</span>
eselect profile set X
</pre>
</div>

<p>
编译过大型软件的同学应该清楚，编译时有很多选项的，Gentoo就把这些选项做成了 <code>USE</code> 标记，只需要设置 <code>USE</code> 变量，编译时就能自动选择需要的功能，比如我想要软件支持声音就在 <code>USE</code> 里加入 <code>audio</code> 字段。如果字段前面有减号，表示去掉这个功能。在 <code>make.conf</code> 设置的 <code>USE</code> 变量是全局生效的， <code>/etc/portage/package.use</code> 可以针对单独软件设置 <code>USE</code> 。
</p>
</div>
</div>

<div id="outline-container-org996966b" class="outline-4">
<h4 id="org996966b">内核</h4>
<div class="outline-text-4" id="text-org996966b">
<p>
内核是安装Gentoo最难的地方了，不管怎么样首先要把内核的源码安装好。
</p>
<div class="org-src-container">
<pre class="src src-shell">emerge --ask sys-kernel/gentoo-sources
</pre>
</div>

<p>
编译内核的时候可以去配置其它的东西，当然引导必须内核安装好后再配置。
</p>

<p>
因为内核编译需要配置，一般有三种方法
</p>
</div>
<ul class="org-ul">
<li><a id="org54a89af"></a>手动配置<br>
<div class="outline-text-5" id="text-org54a89af">
<p>
进入内核源码的目录，然后参照<a href="http://www.jinbuguo.com/kernel/longterm-linux-kernel-options.html">Linux-4.4-x86_64 内核配置选项简介</a>一个一个选项进行配置。
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #556b2f;"># </span><span style="color: #556b2f;">&#36825;&#26159;&#20010;&#36719;&#38142;&#25509;&#65292;&#21487;&#20197;&#20351;&#29992;eselect kernel&#31649;&#29702;</span>
<span style="font-weight: bold;">cd</span> /usr/src/linux
<span style="color: #556b2f;"># </span><span style="color: #556b2f;">&#37197;&#32622;&#20869;&#26680;&#65292;&#25105;&#27604;&#36739;&#21916;&#27426; </span><span style="color: #556b2f; font-weight: bold;">make</span><span style="color: #556b2f;"> nconfig</span>
<span style="font-weight: bold;">make</span> menuconfig
<span style="color: #556b2f;"># </span><span style="color: #556b2f;">-j&#21518;&#38754;&#36319;&#20320;&#30340;cpu&#32447;&#31243;&#25968;&#21152;1</span>
<span style="font-weight: bold;">make</span> -j5
<span style="font-weight: bold;">make</span> modules_install
<span style="font-weight: bold;">make</span> intall
</pre>
</div>
</div>
</li>
<li><a id="org4f8ecb1"></a>现有配置<br>
<div class="outline-text-5" id="text-org4f8ecb1">
<p>
一般的Linux都有个 <code>/proc/config.gz</code> 文件，保存着内核的配置，使用 <code>zcat</code> 命令可以读取。所以可以直接使用这个配置，当然你也可以网上下载不错的配置。
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="font-weight: bold;">cd</span> /usr/src/linux
<span style="color: #556b2f;"># </span><span style="color: #556b2f;">.config &#23601;&#26159;&#32534;&#35793;&#26102;&#20351;&#29992;&#30340;&#37197;&#32622;&#25991;&#20214;</span>
zcat /proc/config.gz &gt; .config
<span style="color: #556b2f;"># </span><span style="color: #556b2f;">&#36319;&#24403;&#21069;&#20869;&#26680;&#21516;&#27493;&#19968;&#19979;&#65292;&#27605;&#31455;&#21442;&#25968;&#32463;&#24120;&#21464;&#21160;</span>
<span style="font-weight: bold;">make</span> syncconfig
<span style="color: #556b2f;"># </span><span style="color: #556b2f;">-j&#21518;&#38754;&#36319;&#20320;&#30340;cpu&#32447;&#31243;&#25968;&#21152;1</span>
<span style="font-weight: bold;">make</span> -j5
<span style="font-weight: bold;">make</span> modules_install
<span style="font-weight: bold;">make</span> intall
</pre>
</div>
</div>
</li>
<li><a id="org063c214"></a>genkernel<br>
<div class="outline-text-5" id="text-org063c214">
<p>
使用这个命令可以直接编译内核，会把所有的选项都编译一遍，记得先更新 <code>/etc/fstab</code> ，缺点就是编译时间太长了。
</p>
<div class="org-src-container">
<pre class="src src-shell">emerge --ask sys-kernel/genkernel
genkernel all
</pre>
</div>
</div>
</li>
</ul>
</div>

<div id="outline-container-org3ea6397" class="outline-4">
<h4 id="org3ea6397">必备配置</h4>
<div class="outline-text-4" id="text-org3ea6397">
<p>
开机必需的配置，比如自动挂载、网络、密码什么的
</p>
</div>
<ul class="org-ul">
<li><a id="org5e514a2"></a>fstab<br>
<div class="outline-text-5" id="text-org5e514a2">
<p>
这个是启动系统前自动挂载的分区，文件是 <code>/etc/fstab</code> 。使用 <code>lsblk</code> 看分区的情况，根据官方的例子修改一下就行了。
</p>
<pre class="example" id="org5308ad7">
# 分区地址  挂载位置     类型    参数
/dev/sda2   /boot        ext2    defaults,noatime     0 2
/dev/sda3   none         swap    sw                   0 0
/dev/sda4   /            ext4    noatime              0 1

# 这个可以不要
/dev/cdrom  /mnt/cdrom   auto    noauto,user          0 0
</pre>
</div>
</li>

<li><a id="orgae1b0d2"></a>网络<br>
<div class="outline-text-5" id="text-orgae1b0d2">
<p>
要我说直接 <code>emerge networkmanager</code> 就行了，官方其它的配置都是一些可有可无的东西。
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #556b2f;"># </span><span style="color: #556b2f;">&#24320;&#26426;&#33258;&#21160;&#25171;&#24320; NetworkManager</span>
rc-update add NetworkManager default
</pre>
</div>
</div>
</li>

<li><a id="orgea9c33e"></a>设置密码<br>
<div class="outline-text-5" id="text-orgea9c33e">
<p>
使用 <code>passwd</code> 设置 <code>root</code> 用户密码。
</p>
</div>
</li>
</ul>
</div>

<div id="outline-container-org576bbd4" class="outline-4">
<h4 id="org576bbd4">引导</h4>
<div class="outline-text-4" id="text-org576bbd4">
<p>
一般都用 <code>grub</code> 来引导的，现在主板有两种 <code>BIOS</code> 和 <code>UEFI</code> ，比较新的主板都是 <code>UEFI</code> 的形式了，特点是界面非常漂亮。 <br>
自己根据情况在<a href="https://wiki.gentoo.org/wiki/Handbook:AMD64/Installation/Bootloader">配置引导</a>里找相应的配置方法，我主要列出 <code>BIOS</code> 的配置过程。
</p>
<div class="org-src-container">
<pre class="src src-shell">emerge --ask --verbose sys-boot/grub:2
<span style="color: #556b2f;"># </span><span style="color: #556b2f;">&#23433;&#35013;&#24341;&#23548;&#21040;&#30828;&#30424;&#19978;&#65292;&#25214;&#21040;&#33258;&#24049;&#30340;&#30828;&#30424;&#20301;&#32622;&#65292;&#21518;&#38754;&#19981;&#35201;&#24102;&#25968;&#23383;</span>
grub-install /dev/sda
<span style="color: #556b2f;"># </span><span style="color: #556b2f;">&#36825;&#20010;&#21253;&#21487;&#20197;&#33258;&#21160;&#26816;&#27979;&#25152;&#26377;&#30828;&#30424;&#19978;&#30340;&#31995;&#32479;&#24182;&#37197;&#32622;</span>
emerge os-prober
<span style="color: #556b2f;"># </span><span style="color: #556b2f;">&#29983;&#25104;&#24341;&#23548;&#25991;&#20214;</span>
grub-mkconfig -o /boot/grub/grub.cfg
</pre>
</div>

<p>
以上全部弄好后就可以重启了，在 <code>BIOS</code> 里设置硬盘启动顺序，如果没有引导菜单，自己重新 <code>chroot</code> 查找原因。
</p>
</div>
</div>
</div>

<div id="outline-container-org1ccd705" class="outline-3">
<h3 id="org1ccd705">配置</h3>
<div class="outline-text-3" id="text-org1ccd705">
</div>
<div id="outline-container-org616a7e9" class="outline-4">
<h4 id="org616a7e9">地区配置</h4>
<div class="outline-text-4" id="text-org616a7e9">
<p>
设置时区
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #556b2f;"># </span><span style="color: #556b2f;">&#35774;&#32622;&#26102;&#21306;&#20026;&#19978;&#28023;&#65292;&#21482;&#35201;&#26159;&#22312;&#20013;&#22269;&#23601;&#36825;&#26679;&#35774;&#32622;</span>
<span style="font-weight: bold;">echo</span> <span style="color: #8a3b3c;">"Asia/Shanghai"</span> &gt; /etc/timezone
emerge --config sys-libs/timezone-data
</pre>
</div>

<p>
设置语言，编辑 <code>/etc/locale.gen</code>
</p>
<pre class="example" id="org112140f">
en_US.UTF-8 UTF-8
zh_CN.UTF_8 UTF-8
C.UTF8 UTF-8
</pre>

<div class="org-src-container">
<pre class="src src-shell">locale-gen
<span style="color: #556b2f;"># </span><span style="color: #556b2f;">&#26597;&#30475;locale&#36873;&#39033;</span>
eselect locale list
<span style="color: #556b2f;"># </span><span style="color: #556b2f;">&#36873;&#25321;&#20013;&#25991;&#25110;&#32773;&#33521;&#25991;</span>
eselect locale set x
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-org7cc1a49" class="outline-2">
<h2 id="org7cc1a49">后记</h2>
<div class="outline-text-2" id="text-org7cc1a49">
<p>
只列举了一些必要的配置，其它应用的配置在其它 <code>blog</code> 里展示。
</p>
</div>
</div>
<div class="taglist"><a href="https://lampze.github.io/tags.html">Tags</a>: <a href="https://lampze.github.io/tag-linux.html">Linux</a> <a href="https://lampze.github.io/tag-gentoo.html">Gentoo</a> <a href="https://lampze.github.io/tag-guide.html">Guide</a> </div></div>
<div id="postamble" class="status"><center>
         <a rel="license" href="https://creativecommons.org/licenses/by-sa/3.0/"></a><br />
         <span xmlns:dct="https://purl.org/dc/terms/"
               href="https://purl.org/dc/dcmitype/Text"
               property="dct:title"
               rel="dct:type">
           https://lampze.github.io
         </span>
         by
         <a xmlns:cc="https://creativecommons.org/ns#"
              href="https://lampze.github.io"
              property="cc:attributionName"
              rel="cc:attributionURL">
           lampze
         </a>
         is licensed under a
         <a rel="license"
            href="https://creativecommons.org/licenses/by-sa/3.0/">
           Creative Commons Attribution-ShareAlike 3.0 Unported License
         </a>.
       </center>
       <script src="https://cdn.bootcdn.net/ajax/libs/jquery/3.5.1/jquery.slim.js"></script>
       <script type="text/javascript" src="static/main.js"></script></div>
</body>
</html>
